Repository: itslearningfr/cas-maestro
Catalog: lang/CAS_Maestro-*.po
Languages: fr_fr

source: Ooops, there was an error.
fr_fr: Oups, il y avait une erreur.

source: The username %s isn't allowed to register in this website. If you think this is a mistake, please contact the <a href="mailto:%s">website administrator</a>.
fr_fr: Le nom d’utilisateur %s n’est pas reconnu. Le système n’a pas réussi a vous enregistrer… Veuillez contacter l’<a href="mailto:%s">administrateur</a> !

source: wpCAS is not configured. Please, login, go to the settings and configure with your credentials.
fr_fr: wpCAS n’est pas configuré. S’il vous plaît, connectez-vous, aller dans les paramètres et configurer avec vos informations d’identification.

source: You don't have a email set. You need to set a email to get ride of this message... <a href="%s"> Click here </a> to access your profile.
fr_fr: Vous ne disposez pas d’un email. Vous devez définir un courriel pour ne plus obtenir ce message … <a href="%s">Cliquez ici</a> pour accéder à votre profil.

source: CAS Maestro Settings
fr_fr: Réglages Maestro CAS

source: General Settings
fr_fr: Paramètres généraux

source: Registration
fr_fr: Enregistrement

source: Important note
fr_fr: Note importante

source: CAS is responding
fr_fr: CAS répond

source: CAS is not responding
fr_fr: CAS ne répond pas

source: LDAP is responding
fr_fr: LDAP répond

source: LDAP is not responding
fr_fr: LDAP ne répond pas

source: Checking...
fr_fr: vérification….

source: Choose the User's role
fr_fr: Choisir le rôle de l’utilisateur

source: CAS Maestro settings has been updated.
fr_fr: Les préférence de CAS Maestro ont été mises à jour

source: CAS Maestro settings has been updated, yet there's still information that needs to be filled.
fr_fr: Les préférence de CAS Maestro ont été mises à jour, cependant certaines informations sont manquantes

source: User registration
fr_fr: Inscription Utilisateur

source: In order to register a new user an email address is required. In case you don’t want to set the email address manually, please chose from the options below.
fr_fr: Afin d’enregistrer un nouvel utilisateur, une adresse email est nécessaire. Si vous ne souhaitez pas la renseigner manuellement, merci de choisir une des options

source: No mail creation
fr_fr: Pas d’email créé

source: E-mail suffix username@
fr_fr: suffixe pour les email username@

source: LDAP server connection
fr_fr: Connexion au serveur LDAP

source: You should finish this configuration with LDAP server data. For anonymous server access, which could not be enough, leave the fields “RDN User” and “Password” blank.
fr_fr: Vous devez finir cette configuration avec les informations du serveur LDAP. Pour un accès anonyme, qui pourrait être insuffisant, laisser vide les champs “RDN User“ et “Password“

source: Server hostname
fr_fr: Nom du serveur

source: (with %s or %s)
fr_fr: (avec %s ou %s)

source: The option to register all users, allows all users to be added to the system with subscriber profile, with no exception.
fr_fr: L’option pour enregistrer tous les utilisateurs, permet à tous les utilisateurs d’être ajoutés au système avec le profil éditeur, sans exception.

source: Register all users?
fr_fr: Enregistrer tous les utilisateurs?

source: Users Allowed to Register
fr_fr: Utilisateurs Autorisés à s’inscrire

source: If you indentify users with the ability to register on the system upfront without confirmation you can also set their names and profile.
fr_fr: Si vous identifiez des utilisateurs avec la capacité à s’inscrire sur le système sans confirmation vous pouvez également indiquer leurs noms et leur profil.

source: To add another user, just fill the last blank element.
fr_fr: Pour ajouter un autre utilisateur, juste renseigner le dernier élément vide.

source: Update options
fr_fr: Mettre à jour les options

source: In case you can not access the content manager due to a misconfiguration of this plugin, the following steps should be performed:
fr_fr: Si vous n’arrivez pas à accéder au gestionnaire de contenu en raison d’une mauvaise configuration de cet plugin, les étapes suivantes doivent être réalisées:

source: Remove the directory of plugin CAS Maestro
fr_fr: Supprimer le répertoire du plugin CAS Maestro

source: Perform access according to the login WordPess
fr_fr: Permettre l’accès avec le login WordPress

source: Reinstall CAS Maestro
fr_fr: Réinstaller CAS Maestro

source: Alternatively, you may simply disable the behavior of CAS Maestro as follows:
fr_fr: Si vous le souhaitez, vous pouvez le comportement du CAS Maestro de la manière suivante:

source: Edit the file %s and search for %s definition
fr_fr: Editer les fichiers %s et rechercher pour la définition %s

source: Before that definition, write %s
fr_fr: Devant la définition, écrire %s

source: Reconfigure the plugin and remove the line that was added.
fr_fr: Reconfigurer le plugin et supprimer la ligne qui a été ajoutée

source: Server settings
fr_fr: Paramètre du serveur

source: The plugin will only be active after the CAS server definitions are filled. After the configuration is done, please verify if the connection is valid. This is strongly advised because If you fill the data incorrrectly, your access to WordPress might be denied.
fr_fr: Le plugin ne sera opérationnel qu’après que les définitions du serveur CAS aient été remplies. Après la réalisation de la configuration, merci de vérifier que la connexion est valide. Cela est fortement recommandé car si vous renseignez les données incorrectement, votre accès à Wordpress pourrait être bloqué.

source: In case you don’t know all the data, or in doubt, you should contact the person responsible for the CAS server.
fr_fr: Si vous ne connaissez pas toutes les données, ou en cas de doute, vous devriez contacter le responsable du serveur CAS.

source: CAS version
fr_fr: Version de CAS

source: Server port
fr_fr: Port du serveur

source: Server path
fr_fr: Chemin du serveur

source: Menu localization
fr_fr: Arrangement du menu

source: Sidebar
fr_fr: Barre latérale

source: Settings menu
fr_fr: menu des paramètres

source: Sender
fr_fr: Expéditeur

source: All mails are sent from a unique sender. This sender may recieve notification emails alerting for new users and/or activations, estabilished by the following configuration.
fr_fr: Tous les email proviennent d’un expéditeur unique. Cet expéditeur peut recevoir les emails d’alerte pour les nouveaux utilisateurs et/ou les activations, selon la configuration établie.

source: E-mail address:
fr_fr: Adresse email:

source: Full name:
fr_fr: Nom complet:

source: Mails
fr_fr: Emails

source: Please set up on witch actions should emails be sent. It’s possible to send emails to the user and the sender, depending on your configuration.
fr_fr: Merci de paramétrer quelles actions doivent être envoyées. Il est possible d’envoyer des emails aux utilisateurs et à l’expéditeur, en fonction de votre configuration.

source: Welcoming
fr_fr: Bienvenue

source: Wait for access
fr_fr: Merci de patienter

source: Send to the User
fr_fr: Envoyer à l’utilisateur

source: Send to the Sender
fr_fr: Envoyer à l’expéditeur

source: Subject
fr_fr: Objet

source: Body
fr_fr: Corps du message

source: Message body sent to the User
fr_fr: Corps du message envoyé à l’utilisateur

source: Message body sent to the Sender
fr_fr: Corps du message envoyé à l’expéditeur

source: You can use the following tokens: %sitename% for the website name, %username% for the user’s name and %realname% for the user’s real name.
fr_fr: Vous pouvez utiliser les tokens suivants: %sitename% pour le nom du site, %username% pour le nom de l’utilisateur et %realname% pour le nom complet de l’utilisateur.
